<script setup>
import { Head, Link } from '@inertiajs/vue3';
import QuestionTemp1 from '../../../Components/QuestionTemp1.vue'
import QuestionTemp2 from '../../../Components/QuestionTemp2.vue'
import QuestionTemp3 from '../../../Components/QuestionTemp3.vue'
import QuestionTemp4 from '../../../Components/QuestionTemp4.vue'

import Pagetitle from '../../../Components/Pagetitle.vue'
import SeihoTestLayout from '@/Layouts/SeihoTestLayout.vue';
import TestNavigationButtons from '@/Components/TestNavigationButtons.vue';

const title = "生命保険計理"
const subject = '2022年度 フォームB'

</script>

<template>

<SeihoTestLayout :title="title">
    <section class="bg-gray-100 text-gray-800 py-10">

        <!-- ページタイトル -->
        <Pagetitle
            :title="title"
            :description="subject"
        />

        <!-- 問題リスト -->
        <div class="max-w-4xl mx-auto mt-4 space-y-2">
            <QuestionTemp4
                :questionNumber="1"
                :title="title"
                :subject="subject"
                :contents="[
                    // 問１
                    {
                        title: '生存率・生存数・平均余命・保険料計算',
                        answer: '0.96114',
                        explanation:
                        '<br>\
                        ＝ 88,751 ÷ 92,339<br>\
                        ＝ 0.961143･･･<br>\
                        ⇒ 小数第6位を四捨五入して <strong>0.96114</strong>' },
                    // 問２
                    {
                        title: '生存率・生存数・平均余命・保険料計算',
                        answer: '98,233',
                        explanation:
                        '<br>生存数 ＝ 期末の生存数 ÷ 期初の生存数 × 期初の生存者数<br><br>\
                        ＝ 96,319 ÷ 98,052 × 100,000<br>\
                        ＝ 98232.5･･･<br>\
                        ⇒ 小数第1位を四捨五入して <strong>98,233</strong>' },
                    // 問３
                    {
                        title: '生存率・生存数・平均余命・保険料計算',
                        answer: '1.26',
                        explanation:
                        '<br>死亡は年間を通じて発生するが、平均して年央に集中発生したものと考えられるので、例えば、100歳から101歳になるまでに死亡する人の平均生存年数は0.5年となる。<br><br>\
                        年齢 ： 死亡数 × 平均生存年数 ＝ 延べ生存年数<br>\
                        104歳 ： 62.726人 × 0.5年 ＝ 31.363 ＝ 31.36<br>\
                        105歳 ： 30.877人 × 1.5年 ＝ 46.3155 ＝ 46.32<br>\
                        116歳 ： 13.8961人 × 2.5年 ＝ 34.74025 ＝ 34.74<br>\
                        107歳 ： 5.6633人 × 3.5年 ＝ 19.82155 ＝ 19.82<br>\
                        108歳 ： 2.0682人 × 4.5年 ＝ 9.3069 ＝ 9.31<br>\
                        109歳 ： 0.9156人 × 5.5年 ＝ 5.0358 ＝ 5.04<br>\
                        → 104歳～109歳の延べ生存年数の合計 ＝ 141.59<br><br>\
                        平均余命 ＝ 延べ生存年数の合計 ÷ 生存者数<br><br>\
                        ＝ 146.59 ÷ 116.15 ＝ 1.262･･･<br>\
                        ⇒ 小数第3位を四捨五入して <strong>1.26</strong>' },
                    // 問４ p39
                    {
                        title: '生存率・生存数・平均余命・保険料計算',
                        answer: '1,194,044',
                        explanation:
                        '<br>55歳の男性は1年間に400人が死亡し、1人あたりの保険金は300万円なので、合計の保険金額は<br>\
                        300万円 × 400人 ＝ 1,200,000千円<br><br>\
                        支払いは年央と仮定し、利率1.0%の期央払現価率0.995037で割引くと<br>\
                        1,200,000千円 × 0.995037 ＝ 1,194,044.4千円<br>\
                        ⇒ 千円未満を四捨五入して <strong>1,194,044千円</strong>' },
                    // 問５ p39
                    {
                        title: '生存率・生存数・平均余命・保険料計算',
                        answer: '12,610',
                        explanation:
                        '<br>問4で求めた死亡保険金の支払いに必要な費用は、55歳男性の年始生存者数94,704人で平等に分担するので、<br>\
                        1,194,044千円 ÷ 94,704人 ＝ 12,608.1･･･円<br>\
                        ⇒ 十円未満を四捨五入して <strong>12,610円</strong>' }
                ]"
                :labels="[
                    'ア','ク','ウ','コ','カ',  //問１〜５
                ]"
            />
            <QuestionTemp4
                :questionNumber="6"
                :title="title"
                :subject="subject"
                :contents="[
                    // 問６
                    {
                        title: '複利運用',
                        answer: '24,120',
                        explanation:
                        '<br>\
                        2,000,000円 × (1 + 0.002) <sup>6</sup> ＝ 2,024,120.32<br><br>\
                        元金との差額が利息なので、<br>\
                        2,024,120.32 - 2,000,000 ＝ 24,120.32<br>\
                        ⇒ 円未満を四捨五入して <strong>24,120円</strong>' },
                    // 問７
                    {
                        title: '複利運用',
                        answer: '2,123,292',
                        explanation:
                        '<br>年利1.2%で半年複利のため、利率は半年あたり0.6%（=0.006）となり、5年間で10回の複利が適用される。<br><br>\
                        よって元金2,000,000円の場合の元利合計金額は、<br>\
                        2,000,000 × (1 + 0.006)<sup>10</sup> ＝ 2,123,292.3･･･<br>\
                        ⇒ 円未満を四捨五入して <strong>2,123,292円</strong>' },
                    // 問８
                    {
                        title: '複利運用',
                        answer: '1.51',
                        explanation:
                        '<br>転化回数：1年間に利息を元金に繰り入れる回数<br><br><br>\
                        実利率 = （ 1 + 名称利率 ÷ 転化回数）<sup>転化回数</sup> - 1<br><br>\
                        （ 1 + 0.015 ÷ 4 ）<sup>4</sup> - 1 ＝ 0.015084 ＝ 1.508･･･%<br>\
                        ⇒ 小数第3位を四捨五入して <strong>1.51%</strong>' },
                    // 問９
                    {
                        title: '複利運用',
                        answer: '1.33',
                        explanation:
                        '<br>年平均利回り：投資によって得られる利益を、投資期間全体で年単位に平均化したもの<br><br>\
                        年平均利回り ＝ （（ 1 + 複利利率）<sup>期間</sup> - 1 ） ÷ 期間<br><br><br>\
                        （（ 1 + 0.013 ）<sup>5</sup> - 1 ） ÷ 5 ＝ 0.0133424 ＝ 1.334･･･%<br>\
                        ⇒ 小数第3位を四捨五入して <strong>1.33%</strong>' },
                    // 問10
                    {
                        title: '複利運用',
                        answer: '1,902,931',
                        explanation:
                        '<br>元金 × （ 1 + 利率 ）<sup>期間</sup> ＝ 元利合計<br>\
                        元金 × （ 1 + 1.0% ）<sup>5年</sup> ＝ 200万円<br>\
                        元金 ＝ 2,000,000 ÷ （ 1 + 0.01 ）<sup>5</sup> ＝ 1,902,931.3･･･<br>\
                        ⇒ 円未満を四捨五入して <strong>1,902,931円</strong>' }
                ]"
                :labels="[
                    'オ','コ','ウ','イ','ク',  //問６〜10
                ]"
            />
            <QuestionTemp3
                :questionNumber="3"
                questionTitle="責任準備金の積立に関する法的規制-①"
                :title="title"
                :subject="subject"
                :contents="[
                '年金','負債','平準純保険料式','ソルベンシー・マージン','ストレステスト', //問11〜15
                ]"
                :labels="[
                'ア','エ','コ','キ','オ',  //問11〜15
                ]"
            />
            <QuestionTemp3
                :questionNumber="4"
                questionTitle="責任準備金の積立に関する法的規制-②"
                :title="title"
                :subject="subject"
                :contents="[
                '未経過保険料','危険保険料','算出方法書','最低保証リスク','保険計理人', //問16〜20
                ]"
                :labels="[
                'エ','コ','イ','ク','ア',  //問16〜20
                ]"
            />
<QuestionTemp4
                :questionNumber="21"
                :title="title"
                :subject="subject"
                :contents="[
                    // 問21
                    {
                        title: '死亡保険金の現価について',
                        answer: '1,529,227千円',
                        explanation:
                        '<br>\
                        死亡保険金 × 死亡数 × 期央払現価 ＝ 死亡保険金の現価<br>\
                        45歳：1,500,000 × 172 × 0.995037 ＝ 256,720千円<br>\
                        46歳：1,500,000 × 189 × 0.985185 ＝ 279,300千円<br>\
                        47歳：1,500,000 × 208 × 0.975431 ＝ 304,334千円<br>\
                        48歳：1,500,000 × 228 × 0.965773 ＝ 330,294千円<br>\
                        49歳：1,500,000 × 250 × 0.956211 ＝ 358,579千円<br>\
                        ⇒ 合計：<strong>1,529,227千円</strong>' },
                    // 問22
                    {
                        title: '満期保険金の現価について',
                        answer: '137,466,380千円',
                        explanation:
                        '<br>5年後に支払う満期保険金の現価は、<br>\
                        5年後の生存数 × 保険金額 × 期末払現価で求める。<br><br>\
                        50歳の生存数 × 150万円 × 5年の期末払現価<br>\
                        96,319 × 1,500,000 × 0.951466 ＝ 137,466,380,481円<br>\
                        ⇒ 千円未満を四捨五入して <strong>137,466,380千円</strong>' },
                    // 問23
                    {
                        title: '予定事業費の現価について',
                        answer: '3,651,225千円',
                        explanation:
                        '<br>予定事業費は保険金1000円につき25円より、一人当たりの予定事業費に加入時の生存数をかけて求める。<br><br><br>\
                        保険金額 × 予定事業費率 × 45歳の生存数<br>\
                        1,500,000 × (25 ÷ 1000) × 97,366 ＝ 3,651,225,000<br>\
                        ⇒ 千円未満を四捨五入して <strong>3,651,225千円</strong>' },
                    // 問24
                    {
                        title: '養老保険の年払保険料について',
                        answer: '300,030円',
                        explanation:
                        '<br>収支相当の原則「収入現価 ＝ 支出現価」で求める。<br><br>\
                        ＜収入現価＞<br>\
                        収入の現価は、45歳〜49歳の各年齢の生存数×年払保険料（P）を現価に換算して合計する。<br><br><br>\
                        年払保険料 × 生存数 × 期始払現価 ＝ 収入現価<br>\
                        45歳 ： P × 97,366 × 1.000000 ＝ 97,366P<br>\
                        46歳 ： P × 97,194 × 0.990099 ＝ 96,232P<br>\
                        47歳 ： P × 97,005 × 0.980296 ＝ 95,094P<br>\
                        48歳 ： P × 96,798 × 0.970590 ＝ 93,951P<br>\
                        49歳 ： P × 96,569 × 0.960980 ＝ 92,801P<br>\
                        → 50歳～54歳の収入現価の合計 ＝ 475,444P<br><br>\
                        ＜支出現価＞<br>\
                        支出現価は問21〜23で算出した結果を用いて求める。<br><br><br>\
                        死亡保険金の現価+満期保険金の現価+予定事業費の現価<br>\
                        ＝ 1,529,227千円 + 137,466,380千円 + 3,651,225千円<br>\
                        ＝ 142,646,832千円<br><br>\
                        収支相当の原則より<br>\
                        475,444P = 142,646,832千円<br>\
                        P ＝ 300,028･･･円 <br>\
                        ⇒ 10円未満を四捨五入して <strong>300,030円</strong>' },
                ]"
                :labels="[
                    'イ','ア','ウ','ア',  //問21〜24
                ]"
            />
            <QuestionTemp1
                :questionNumber="25"
                :title="title"
                :subject="subject"
                :contents="[ //p134 (2023-A-25,2023-B-25,2023-C-25,2022-A-25,2022-B-25,2022-C-25)
                '配当金を<u><b>一時</b></u>払保険料として契約応当日に保険を買増し（保険金を増額）する。',
                '配当金を保険料払込回数に等分して、毎回の保険料に充当、相殺する。',
                '正しい'
                ]"
            />
            <QuestionTemp1
                :questionNumber="26"
                :title="title"
                :subject="subject"
                :contents="[
                '正しい',
                '契約者に魅力を感じさせるに十分な料率でなければならないが、これは他社や隣接業界より<u><b>営業保険料を安くすることを必ずしも意味していない</b></u>。', //p57
                '正しい'
                ]"
            />
            <QuestionTemp1
                :questionNumber="27"
                :title="title"
                :subject="subject"
                :contents="[ //p79
                '正しい',
                '保険料積立金は養老保険では年を追って逓増し、満期時に満期保険金相当額に達する。一方、<u><b>定期保険</u></b>では、ゆるやかな山なりのカーブを描いて最終的にゼロになる。',
                '正しい'
                ]"
            />
            <QuestionTemp1
                :questionNumber="28"
                :title="title"
                :subject="subject"
                :contents="[ //p113 (2022-A-28,2022-B-28,2022-C-28)
                '正しい',
                '正しい',
                '満期時まで続いてなお解約返戻金（保険料積立金）の残額があれば生存保険金として、その額を支払う。'
                ]"
            />
            <QuestionTemp1
                :questionNumber="29"
                :title="title"
                :subject="subject"
                :contents="[ //p129 (2023-B-30,2022-A-29,2022-B-29,2022-C-29)
                '正しい',
                '配当金の支払いを行わない無配当保険や5年ごと利差配当付保険のような保険は、保険料は通常の有配当保険より<u><b>安くなる</b></u>のが一般的である。',
                '正しい'
                ]"
            />
            <QuestionTemp1
                :questionNumber="30"
                :title="title"
                :subject="subject"
                :contents="[ //p98
                '正しい',
                '正しい',
                '危険準備金は、「保険リスク」、「第三分野保険の保険りスク」、「予定利率リスク」および「最低保証リスク」に備えるために積み立てるものである。'
                ]"
            />
            <QuestionTemp2
                :questionNumber="31"
                :title="title"
                :subject="subject"
                :contents="[
                // 問31〜35
                '正しい',
                '正しい',
                '正しい',
                '通常、単に現価という場合には<u><b>期末払現価</b></u>を指す。', //p27
                '正しい',
                // 問36〜40
                'すべての契約について累積額が増加するわけではなく、定期保険などのように、保険期間の<u><b>後半</b></u>にその年度の残額がマイナスになる場合もあることに注意が必要である。', //p65
                '現在、国内で採用されている解約返戻金の一般的な算式（個人保険の代表的なもの）は、次のとおりである。<br>解約返戻金 ＝ (<u><b>解約までの経過期間に応じた純保険料式保険料積立金</b></u>) － (保険料払込中の場合、その経過期間に応じた保険金比例に一定額)',
                '正しい',
                '変額保険の資産運用に関するリスクは、すべて<u><b>契約者</b></u>に帰属する。', //p150
                '保険業法上の規定によるもの。', //p144
                 //問41〜50
                'B-毎年', 'A-年平残方式', 'A-現価', 'B-低くなる', 'B-契約者貸付',
                'C（A・Bともに正しい）', 'C（A・Bともに正しい）', 'B-20%', 'A-超過資産', 'B-通常保険料',
                ]"
                :labels="[
                '解','解','解','解','解',  //問31〜35
                '解','解','解','解','解',  //問36〜40
                'ウ','イ','ア','ウ','エ',  //問41〜45
                'オ','オ','ウ','ア','ウ',  //問46〜50
                ]"
            />
        </div>

                <TestNavigationButtons previous-route="keiri2022a" next-route="keiri2022c" />

    </section>

    </SeihoTestLayout>


</template>
